{
  "basics": {
    "name": "Jostein Barry-Straume",
    "label": "Machine Learning Engineer",
    "image": "",
    "email": "jostein at vt dot edu",
    "phone": "",
    "url": "https://josteinbarrystraume.github.io/",
    "summary": "My work involves physics-informed machine learning, uncertainty quantification, and optimal control. My projects are interdisciplinary, and I work with fellow computer scientists, mathematicians, and mechanical engineers to apply machine learning methods to solve real world problems using large, non-simulated datasets generated from proprietary sensor readings.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "",
      "countryCode": "",
      "region": ""
    },
    "profiles": [
      {
        "network": "",
        "username": "",
        "url": ""
      }
    ]
  },
  "work": [
    {
      "name": "Rolls-Royce University Technology Center, Virginia Tech",
      "position": "Rolls-Royce Graduate Fellow",
      "url": "https://rollsroyce.me.vt.edu/",
      "startDate": "2023",
      "endDate": "Present",
      "summary": "Investigate uncertainty quantification (UQ) methods for neural networks to predict turbine gas temperature (TGT), using engine health management (EHM) data, with quantifiable uncertainty.\nCorrelate TGT predictions with engine degradation to predict remaining useful lifespan (RUL) of various turbofan engines.",
      "highlights": ["Engine Health Management", "Uncertainty Quantification", "Scientific Machine Learning", "Transfer Learning"]
    },
    {
      "name": "Computational Science Laboratory, Virginia Tech",
      "position": "Graduate Research Assistant",
      "url": "https://csl.cs.vt.edu/",
      "startDate": "2020",
      "endDate": "Present",
      "summary": "Apply physics-informed neural networks (PINNs) to optimal control problems. Leverage automatic differentiation to impart the physical laws of a dynamical system into a neural network’s training regiment. Implement custom neural network loss functions that use mixed and partial derivatives via automatic differentiation.",
      "highlights": ["Scientific Machine Learning", "Physics-Informed Neural Networks", "Optimal Control Problems", "Ensemble Control", "Hamilton-Jacobi-Bellman Equation"]
    },
    {
      "name": "Department of Computer Science, Virginia Tech",
      "position": "Graduate Research Assistant",
      "url": "https://cs.vt.edu/",
      "startDate": "2020",
      "endDate": "Present",
      "summary": "Lead Graduate Teaching Assistant (GTA) for CS3604: Professionalism for Computing. GTA for CS3114/CS5040: Data Structures and Algorithm Analysis.",
      "highlights": ["Instructor", "Course Administration", "Data Structures", "Algorithm Analysis", "Java"]
    },
    {
      "name": "Laboratory for Applied Mathematics, Numerical Software, and Statistics (LANS), Argonne National Laboratory",
      "position": "Givens Associate: Mathematics & Computer Science",
      "url": "https://www.anl.gov/mcs/lans",
      "startDate": "2022",
      "endDate": "2022",
      "summary": "The Givens Associate positions are intended to encourage professional growth in graduate students who are beginning careers in numerical analysis or computational mathematics. Research the following automatic differentiation modes: reverse (back-propagation), forward, and mixed (mixing and matching both reverse and forward in the same neural network). Contribute to the development of AutoMAD, a mixed mode automatic differentiation API for PyTorch’s automatic differentiation engine (Autograd): https://github.com/jhueckelheim/AutoMAD",
      "highlights": ["Automatic Differentiation", "Computational Mathematics"]
    },
    {
      "name": "Los Alamos National Laboratory",
      "position": "PhD Intern: Information Systems & Modeling",
      "url": "https://www.lanl.gov/",
      "startDate": "2022",
      "endDate": "2022",
      "summary": "Research approaches in risk assessment and risk reduction for national critical cyber and physical infrastructure. Apply natural language processing (NLP) techniques to decompose national critical functions (NCFs) into sub-functions for the purposes of highlighting vital functional resilience and potential vulnerabilities. Contribute to graph analytics via network path analysis, critical node identification, and automated graph discovery (data analytics, machine learning, and NLP methods).",
      "highlights": ["Natural Language Processing", "Ontological Decomposition", "Graph Analysis", "Risk Assessment"]
    },
    {
      "name": "Fortive",
      "position": "Data Science Intern",
      "url": "",
      "startDate": "2018",
      "endDate": "2018",
      "summary": "Improve annual direct and indirect spend visibility with natural language processing (NLP) solutions. Label unstructured procurement data with NLP methods to increase spend visibility by $658 million. Use regression neural network to forecast daily spend by supplier per operating company (mean absolute error: 11%)",
      "highlights": ["Natural Language Processing", "Procurement"]
    },
    {
      "name": "Microsoft",
      "position": "Data Analyst",
      "url": "",
      "startDate": "2017",
      "endDate": "2016",
      "summary": "Support Worldwide Licensing sales teams with customized agreement quotes, price sheets and amendments for contract negotiations. Identify and resolve discrepancies between Customer/Channel Price Sheets. Maintain team error rate below 3% target.",
      "highlights": ["Data Analysis"]
    }
    
  ],
  "education": [
    {
      "institution": "Virginia Tech, Blacksburg, Virginia",
      "location": "Blacksburg, Virginia",
      "url": "https://cs.vt.edu/",
      "area": "Computer Science",
      "studyType": "PhD",
      "startDate": "2020",
      "endDate": "2025",
      "score": "",
      "courses": ["Advisor: Dr. Adrian Sandu", "Co-Advisor: Dr. Changmin Son"]
    },
    {
      "institution": "Southern Methodist University, Dallas, Texas",
      "location": "Dallas, Texas",
      "url": "",
      "area": "Data Science",
      "studyType": "M.S.",
      "startDate": "2017",
      "endDate": "2018",
      "score": "",
      "courses": ["Machine Learning Specialization"]
    },
    {
      "institution": "University of Southern California, Los Angeles, California",
      "location": "Los Angeles, California",
      "url": "",
      "area": "Economics",
      "studyType": "B.A.",
      "startDate": "",
      "endDate": "",
      "score": "",
      "courses": []
    }
  ],
  "publications": [
    {
      "name": "An evaluation of training size impact on validation accuracy for optimized convolutional neural networks",
      "publisher": "SMU Data Science Review",
      "releaseDate": "2019-01-18",
      "url": "https://scholar.smu.edu/datasciencereview/vol1/iss4/12/",
      "summary": "In this paper, we present an evaluation of training size impact on validation accuracy for an optimized Convolutional Neural Network (CNN). CNNs are currently the state-of-the-art architecture for object classification tasks. We used Amazon’s machine learning ecosystem to train and test 648 models to find the optimal hyperparameters with which to apply a CNN towards the Fashion-MNIST (Mixed National Institute of Standards and Technology) dataset. We were able to realize a validation accuracy of 90% by using only 40% of the original data. We found that hidden layers appear to have had zero impact on validation accuracy, whereas the neural density of the network and the chosen optimization function had the greatest impact."
    },
    {
      "name": "Physics-informed neural networks for PDE-constrained optimization and control",
      "publisher": "arXiv",
      "releaseDate": "2022-08-18",
      "url": "https://arxiv.org/abs/2205.03377",
      "summary": "A fundamental problem in science and engineering is designing optimal control policies that steer a given system towards a desired outcome. This work proposes Control Physics-Informed Neural Networks (Control PINNs) that simultaneously solve for a given system state, and for the optimal control signal, in a one-stage framework that conforms to the underlying physical laws. Prior approaches use a two-stage framework that first models and then controls a system in sequential order. In contrast, a Control PINN incorporates the required optimality conditions in its architecture and in its loss function. The success of Control PINNs is demonstrated by solving the following open-loop optimal control problems: (i) an analytical problem, (ii) a one-dimensional heat equation, and (iii) a two-dimensional predator-prey problem."
    }
  ]
}
